---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostFaceOrCover
source: html/315e8a24-5a63-0310-758d-56420196880c.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostFaceOrCover Method

Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover.'

## Syntax (C#)
```csharp
public bool IsToHostFaceOrCover()
```